; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	spectrograph0 - mode
	image2 - mode
	infrared1 - mode
	spectrograph3 - mode
	Star2 - direction
	Star0 - direction
	GroundStation1 - direction
	Phenomenon3 - direction
	Star4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image2)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 Star0)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 145)
	(supports instrument3 spectrograph3)
	(supports instrument3 spectrograph0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star0)
	(supports instrument4 spectrograph3)
	(supports instrument4 image2)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star2)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 197)
	(supports instrument6 spectrograph0)
	(supports instrument6 image2)
	(supports instrument6 spectrograph3)
	(calibration_target instrument6 Star2)
	(supports instrument7 image2)
	(calibration_target instrument7 Star2)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 GroundStation1)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 139)
	(supports instrument9 infrared1)
	(supports instrument9 image2)
	(calibration_target instrument9 Star0)
	(supports instrument10 infrared1)
	(calibration_target instrument10 Star0)
	(supports instrument11 spectrograph3)
	(calibration_target instrument11 GroundStation1)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(on_board instrument11 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
	(= (data_capacity satellite3) 1000)
	(= (fuel satellite3) 127)
	(= (data Phenomenon3 spectrograph0) 217)
	(= (data Star4 spectrograph0) 197)
	(= (data Planet5 spectrograph0) 88)
	(= (data Phenomenon6 spectrograph0) 192)
	(= (data Star7 spectrograph0) 75)
	(= (data Planet8 spectrograph0) 161)
	(= (data Phenomenon3 image2) 145)
	(= (data Star4 image2) 19)
	(= (data Planet5 image2) 69)
	(= (data Phenomenon6 image2) 280)
	(= (data Star7 image2) 23)
	(= (data Planet8 image2) 202)
	(= (data Phenomenon3 infrared1) 223)
	(= (data Star4 infrared1) 104)
	(= (data Planet5 infrared1) 275)
	(= (data Phenomenon6 infrared1) 28)
	(= (data Star7 infrared1) 107)
	(= (data Planet8 infrared1) 182)
	(= (data Phenomenon3 spectrograph3) 96)
	(= (data Star4 spectrograph3) 6)
	(= (data Planet5 spectrograph3) 84)
	(= (data Phenomenon6 spectrograph3) 143)
	(= (data Star7 spectrograph3) 96)
	(= (data Planet8 spectrograph3) 187)
	(= (slew_time Star2 Star0) 64.04)
	(= (slew_time Star0 Star2) 64.04)
	(= (slew_time Star2 GroundStation1) 19.9)
	(= (slew_time GroundStation1 Star2) 19.9)
	(= (slew_time GroundStation1 Star0) 55.84)
	(= (slew_time Star0 GroundStation1) 55.84)
	(= (slew_time Phenomenon3 Star0) 23.43)
	(= (slew_time Star0 Phenomenon3) 23.43)
	(= (slew_time Phenomenon3 GroundStation1) 16.04)
	(= (slew_time GroundStation1 Phenomenon3) 16.04)
	(= (slew_time Phenomenon3 Star2) 99.69)
	(= (slew_time Star2 Phenomenon3) 99.69)
	(= (slew_time Star4 Star0) 33.16)
	(= (slew_time Star0 Star4) 33.16)
	(= (slew_time Star4 GroundStation1) 16.16)
	(= (slew_time GroundStation1 Star4) 16.16)
	(= (slew_time Star4 Star2) 20.84)
	(= (slew_time Star2 Star4) 20.84)
	(= (slew_time Star4 Phenomenon3) 11.1)
	(= (slew_time Phenomenon3 Star4) 11.1)
	(= (slew_time Planet5 Star0) 62.33)
	(= (slew_time Star0 Planet5) 62.33)
	(= (slew_time Planet5 GroundStation1) 53.78)
	(= (slew_time GroundStation1 Planet5) 53.78)
	(= (slew_time Planet5 Star2) 7.696)
	(= (slew_time Star2 Planet5) 7.696)
	(= (slew_time Planet5 Phenomenon3) 12.39)
	(= (slew_time Phenomenon3 Planet5) 12.39)
	(= (slew_time Planet5 Star4) 40.5)
	(= (slew_time Star4 Planet5) 40.5)
	(= (slew_time Phenomenon6 Star0) 16.14)
	(= (slew_time Star0 Phenomenon6) 16.14)
	(= (slew_time Phenomenon6 GroundStation1) 47.73)
	(= (slew_time GroundStation1 Phenomenon6) 47.73)
	(= (slew_time Phenomenon6 Star2) 2.663)
	(= (slew_time Star2 Phenomenon6) 2.663)
	(= (slew_time Phenomenon6 Phenomenon3) 5.824)
	(= (slew_time Phenomenon3 Phenomenon6) 5.824)
	(= (slew_time Phenomenon6 Star4) 22.8)
	(= (slew_time Star4 Phenomenon6) 22.8)
	(= (slew_time Phenomenon6 Planet5) 54.19)
	(= (slew_time Planet5 Phenomenon6) 54.19)
	(= (slew_time Star7 Star0) 61.9)
	(= (slew_time Star0 Star7) 61.9)
	(= (slew_time Star7 GroundStation1) 57.5)
	(= (slew_time GroundStation1 Star7) 57.5)
	(= (slew_time Star7 Star2) 37.34)
	(= (slew_time Star2 Star7) 37.34)
	(= (slew_time Star7 Phenomenon3) 36.15)
	(= (slew_time Phenomenon3 Star7) 36.15)
	(= (slew_time Star7 Star4) 12.83)
	(= (slew_time Star4 Star7) 12.83)
	(= (slew_time Star7 Planet5) 54.57)
	(= (slew_time Planet5 Star7) 54.57)
	(= (slew_time Star7 Phenomenon6) 74.43)
	(= (slew_time Phenomenon6 Star7) 74.43)
	(= (slew_time Planet8 Star0) 55.35)
	(= (slew_time Star0 Planet8) 55.35)
	(= (slew_time Planet8 GroundStation1) 56.69)
	(= (slew_time GroundStation1 Planet8) 56.69)
	(= (slew_time Planet8 Star2) 70.71)
	(= (slew_time Star2 Planet8) 70.71)
	(= (slew_time Planet8 Phenomenon3) 20.31)
	(= (slew_time Phenomenon3 Planet8) 20.31)
	(= (slew_time Planet8 Star4) 35.45)
	(= (slew_time Star4 Planet8) 35.45)
	(= (slew_time Planet8 Planet5) 19.43)
	(= (slew_time Planet5 Planet8) 19.43)
	(= (slew_time Planet8 Phenomenon6) 3.755)
	(= (slew_time Phenomenon6 Planet8) 3.755)
	(= (slew_time Planet8 Star7) 51.3)
	(= (slew_time Star7 Planet8) 51.3)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite2 Planet8)
	(pointing satellite3 Star0)
	(have_image Star4 spectrograph0)
	(have_image Phenomenon6 spectrograph0)
	(have_image Star7 spectrograph0)
	(have_image Planet8 image2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite2 phenomenon6 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 phenomenon6)
   changed: (fuel satellite2) from 139 to 64.57, (fuel-used) from 0 to 74.43
   goals met: 0 of 6
2. (turn_to satellite3 star0 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 star0)
   changed: (fuel satellite3) from 127 to 71.16, (fuel-used) from 74.43 to 130.27
   goals met: 1 of 6
3. (turn_to satellite0 star4 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star4)
   changed: (fuel satellite0) from 145 to 128.84, (fuel-used) from 130.27 to 146.43
   goals met: 1 of 6
4. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 1 of 6
5. (turn_to satellite2 planet8 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 planet8)
   changed: (fuel satellite2) from 64.57 to 60.815, (fuel-used) from 146.43 to 150.185
   goals met: 2 of 6
6. (turn_to satellite2 phenomenon6 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 phenomenon6)
   changed: (fuel satellite2) from 60.815 to 57.06, (fuel-used) from 150.185 to 153.94
   goals met: 1 of 6
7. (switch_off instrument6 satellite2)
   deleted: (power_on instrument6)
   added: (power_avail satellite2)
   goals met: 1 of 6
8. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 1 of 6
9. (turn_to satellite2 star2 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 star2)
   changed: (fuel satellite2) from 57.06 to 54.397, (fuel-used) from 153.94 to 156.603
   goals met: 1 of 6
10. (turn_to satellite2 phenomenon6 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 phenomenon6)
   changed: (fuel satellite2) from 54.397 to 51.734, (fuel-used) from 156.603 to 159.266
   goals met: 1 of 6
11. (switch_off instrument7 satellite2)
   deleted: (power_on instrument7)
   added: (power_avail satellite2)
   goals met: 1 of 6
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 6
13. (turn_to satellite2 star2 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 star2)
   changed: (fuel satellite2) from 51.734 to 49.071, (fuel-used) from 159.266 to 161.929
   goals met: 1 of 6
14. (turn_to satellite0 groundstation1 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 128.84 to 112.68, (fuel-used) from 161.929 to 178.089
   goals met: 1 of 6
15. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 1 of 6
16. (turn_to satellite0 star4 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star4)
   changed: (fuel satellite0) from 112.68 to 96.52, (fuel-used) from 178.089 to 194.249
   goals met: 1 of 6
17. (turn_to satellite2 phenomenon6 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 phenomenon6)
   changed: (fuel satellite2) from 49.071 to 46.408, (fuel-used) from 194.249 to 196.912
   goals met: 1 of 6
18. (take_image satellite0 star4 instrument0 spectrograph0)
   added: (have_image star4 spectrograph0)
   changed: (data_capacity satellite0) from 1000 to 803, (data-stored) from 0 to 197
   goals met: 2 of 6
19. (turn_to satellite0 star7 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 96.52 to 83.69, (fuel-used) from 196.912 to 209.742
   goals met: 2 of 6
20. (turn_to satellite2 planet8 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 planet8)
   changed: (fuel satellite2) from 46.408 to 42.653, (fuel-used) from 209.742 to 213.497
   goals met: 3 of 6
21. (turn_to satellite2 phenomenon6 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 phenomenon6)
   changed: (fuel satellite2) from 42.653 to 38.898, (fuel-used) from 213.497 to 217.252
   goals met: 2 of 6
22. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 2 of 6
23. (turn_to satellite2 star2 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 star2)
   changed: (fuel satellite2) from 38.898 to 36.235, (fuel-used) from 217.252 to 219.915
   goals met: 2 of 6
24. (calibrate satellite2 instrument6 star2)
   added: (calibrated instrument6)
   goals met: 2 of 6
25. (turn_to satellite2 phenomenon6 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 phenomenon6)
   changed: (fuel satellite2) from 36.235 to 33.572, (fuel-used) from 219.915 to 222.578
   goals met: 2 of 6
26. (turn_to satellite2 planet8 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 planet8)
   changed: (fuel satellite2) from 33.572 to 29.817, (fuel-used) from 222.578 to 226.333
   goals met: 3 of 6
27. (take_image satellite2 planet8 instrument6 image2)
   added: (have_image planet8 image2)
   changed: (data_capacity satellite2) from 1000 to 798, (data-stored) from 197 to 399
   goals met: 4 of 6
28. (turn_to satellite2 phenomenon6 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 phenomenon6)
   changed: (fuel satellite2) from 29.817 to 26.062, (fuel-used) from 226.333 to 230.088
   goals met: 3 of 6
29. (take_image satellite2 phenomenon6 instrument6 spectrograph0)
   added: (have_image phenomenon6 spectrograph0)
   changed: (data_capacity satellite2) from 798 to 606, (data-stored) from 399 to 591
   goals met: 4 of 6
30. (turn_to satellite2 planet8 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 planet8)
   changed: (fuel satellite2) from 26.062 to 22.307, (fuel-used) from 230.088 to 233.843
   goals met: 5 of 6
31. (take_image satellite0 star7 instrument0 spectrograph0)
   added: (have_image star7 spectrograph0)
   changed: (data_capacity satellite0) from 803 to 728, (data-stored) from 591 to 666
   goals met: 6 of 6
